<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
<head>
  <title>Getting Started with Neo4J - Part 2</title>
  <link rel="stylesheet" type="text/css" href="../css/polarsparc-v2.0.css"/>
</head>
<body>
  <br />
  <div id="title-div">
    <p>Getting Started with Neo4J - Part 2</p>
  </div>
  <br/>
  <table id="ad-table">
    <tbody>
      <tr>
        <td class="author-td">Bhaskar S</td>
        <td class="date-td">12/02/2017</td>
      </tr>
    </tbody>
  </table>
  <hr class="line-hr" /> <br />
  <div id="step-div">
    <p>Overview</p>
  </div>
  <div id="para-div">
  	<p>In <a href="http://polarsparc.github.io/Neo4J/Neo4J-1.html" target="_blank"><span class="bold">Part-1</span></a>
      of this series, we setup a docker instance for <span class="bold">Neo4J</span> and briefly explored the web-based
      user interface for <span class="bold">Neo4J</span>. In this part, we will get our hands dirty with the SQL like
      query language for <span class="bold">Neo4J</span> called <span class="hi-yellow">Cypher</span>.</p>
  </div>
  <div id="step-div">
    <p>Hands-on with Cypher</p>
  </div>
  <div id="para-div">
    <p>Just as <span class="bold">SQL</span> is the query and data manipulation language for the ralational databases,
      so is <span class="bold">Cypher</span> for <span class="bold">Neo4J</span>.</p>
    <p><span class="bold">Cypher</span> is a declarative language, in which, one indicates &quot;WHAT&quot; pattern one
      is looking for and the <span class="bold">Neo4J</span> figures the &quot;HOW&quot; to find and retrieve the data.
      As a result, one can express data patterns in a way that is natural to humans, making it easy to understand and
      maintain. Of course, there is a syntax to be followed that is native to <span class="bold">Cypher</span>.</p>
  </div>
  <div id="para-div">
    <p>The three most important aspects in <span class="bold">Neo4J</span> are the nodes, relationships, and properties.</p>
    <p>The following are some of the basic syntax rules in <span class="bold">Cypher</span>:</p>
  </div>
  <div id="para-div">
    <p>Use the syntax <span class="hi-yellow">()</span> (parenthesis) to represent a node in <span class="bold">Neo4J</span>.
      The following are some usage patterns:</p>
    <ul id="blue-sqr-ul">
      <li>
        <p>To access any node using an identifier <span class="hi-yellow">n</span>, use the syntax
          <span class="hi-yellow">(n)</span></p>
      </li>
      <li>
        <p>To access any node with label <span class="hi-yellow">L</span>, using an identifier <span class="hi-yellow">n</span>,
          use the syntax <span class="hi-yellow">(n:L)</span></p>
      </li>
      <li>
        <p>To access any node with more than one label such as <span class="hi-yellow">L1</span> and
          <span class="hi-yellow">L2</span>, , using an identifier <span class="hi-yellow">n</span>, use the syntax
          <span class="hi-yellow">(n:L1:L2)</span></p>
      </li>
    </ul>
  </div>
  <div id="para-div">
    <p>Use the syntax <span class="hi-yellow">[]</span> (square brackets) to represent a relationship in
      <span class="bold">Neo4J</span>. The following are some usage patterns:</p>
    <ul id="blue-sqr-ul">
      <li>
        <p>To access a particular relationship <span class="hi-yellow">R</span>, use the syntax
          <span class="hi-yellow">[:R]</span></p>
      </li>
      <li>
        <p>To access a relationship using an identifier <span class="hi-yellow">r</span>, use the syntax
          <span class="hi-yellow">[r:R]</span></p>
      </li>
    </ul>
  </div>
  <div id="para-div">
    <p>Use the syntax <span class="hi-yellow">{}</span> (curly braces) to represent properties in <span class="bold">Neo4J</span>.</p>
  </div>
  <div id="para-div">
    <p>Use the syntax <span class="hi-yellow">() -[]-&gt; ()</span> to represent directional relationship from one node to another,
      where the syntax <span class="bold">()</span> on the left and right represent nodes and the syntax
      <span class="bold">-[]-&gt;</span> represents the uni-directional relationship. Use the syntax
      <span class="hi-yellow">-[]-</span> (without the greater or arrow charater) to represent a bi-directional relationship.</p>
  </div>
  <div id="para-div">
    <p>To get started, we need some data (graph nodes and relationships) in the <span class="bold">Neo4J</span> database. We will
      create some graph elements (nodes and relationships) using the <span class="hi-yellow">CREATE</span> clause.</p>
    <p>The following is the syntax for creating graph nodes:</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">CREATE (n:L1:L2: ... :Lm {k1: v1, k2: v2, ... , kn:vn})</span></p>
    <p>where, <span class="bold">n</span> is the name, <span class="bold">L1</span>, <span class="bold">L2</span>, through
      <span class="bold">Lm</span> are the labels, <span class="bold">k1: v1</span>, <span class="bold">k2: v2</span>, through
      <span class="bold">kn: vn</span> are the properties (key-value pairs).</p>
  </div>
  <div id="para-div">
    <p>The following is an example that creates a node that has the name <span class="bold">Alice</span> with the label
      <span class="bold">User</span>, and few properties such as <span class="bold">name</span>, <span class="bold">uid</span>,
      <span class="bold">email</span>, <span class="bold">state</span>, and <span class="bold">type</span>:</p>
  </div>
  <div id="cmd-div">
    <p>CREATE (Alice:User {name:'Alice Pink', uid: 'alice', email: 'alice.pink@earth.com', state: 'nj', type: 'employee'})</p>
  </div>
  <div id="para-div">
    <p>The following is another example that creates a node that has the name <span class="bold">ProjectManagement</span> with
      the label <span class="bold">Group</span>, and one property called <span class="bold">name</span>:</p>
  </div>
  <div id="cmd-div">
    <p>CREATE (ProjectManagement:Group {name:'Project Management'})</p>
  </div>
  <div id="para-div">
    <p>The following is the syntax for creating a graph relationship between two nodes:</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">CREATE (n1) -[:R {k1: v1, k2: v2, ... , kn:vn}]-> (n2)</span></p>
    <p>where, <span class="bold">n1</span> &amp; <span class="bold">n2</span> are the nodes, <span class="bold">k1: v1</span>,
      <span class="bold">k2: v2</span>, through <span class="bold">kn: vn</span> are the properties (key-value pairs) of the
      relationship and <span class="bold">R</span> is the relationship type.</p>
  </div>
  <div id="para-div">
    <p>The following is an example that creates a uni-directional relationship between the node <span class="bold">Alice</span>
      and the node <span class="bold">ProjectManagement</span> with the relationship type <span class="bold">BELONGS_TO</span>
      with one property called <span class="bold">context</span>:</p>
  </div>
  <div id="cmd-div">
    <p>CREATE (Alice) -[:BELONGS_TO {context: 'pm'}]-> (ProjectManagement)</p>
  </div>
  <div id="para-div">
    <p>Now that we know the syntax for the creation of graph nodes and relationships using the <span class="bold">CREATE</span>
      clause, we will create some sample data using the <span class="bold">Neo4J</span> web browser interface.</p>
  </div>
  <div id="para-div">
    <p>The following is the set of sample nodes and relationships between them:</p>
  </div>
  <fieldset id="sc-fieldset"> <legend>CREATE clauses</legend>
    <pre>// Create User Nodes
CREATE (Alice:User {name:'Alice Pink', uid: 'alice', email: 'alice.pink@earth.com', state: 'nj', type: 'employee'})
CREATE (Bob:User {name:'Bob Green', uid: 'bob', email: 'bob.green@earth.com', state: 'ny', type: 'employee'})
CREATE (Charlie:User {name:'Charlie Brown', uid: 'charlie', email: 'charlie.brown@earth.com', state: 'nj', type: 'consultant'})
CREATE (David:User {name:'David Black', uid: 'david', email: 'david.black@earth.com', state: 'tx', type: 'employee'})
CREATE (Frank:User {name:'Frank Grey', uid: 'frank', email: 'frank.grey@earth.com', state: 'ny', type: 'employee'})
CREATE (Gary:User {name:'Gary White', uid: 'gary', email: 'gary.white@earth.com', state: 'tx', type: 'consultant'})
CREATE (Harry:User {name:'Harry Blue', uid: 'harry', email: 'harry.blue@earth.com', state: 'nj', type: 'consultant'})

// Create Group Nodes
CREATE (ProjectManagement:Group {name:'Project Management'})
CREATE (CoreEngineering:Group {name:'Core Engineering'})

// Create User to Group Relationships
CREATE (Alice) -[:BELONGS_TO {context: 'pm'}]-> (ProjectManagement)
CREATE (Bob) -[:BELONGS_TO {context: 'pm'}]-> (ProjectManagement)
CREATE (Bob) -[:BELONGS_TO {context: 'architect'}]-> (CoreEngineering)
CREATE (Charlie) -[:BELONGS_TO {context: 'pm'}]-> (ProjectManagement)
CREATE (David) -[:BELONGS_TO {context: 'developer'}]-> (CoreEngineering)
CREATE (Frank) -[:BELONGS_TO {context: 'developer'}]-> (CoreEngineering)
CREATE (Gary) -[:BELONGS_TO {context: 'pm'}]-> (ProjectManagement)
CREATE (Harry) -[:BELONGS_TO {context: 'architect'}]-> (CoreEngineering)</pre>
  </fieldset>
  <div id="para-div">
    <p>Fire up a web-browser, open the URL <span class="bold">http://localhost:7474</span>, and login to the
      <span class="bold">Neo4J</span> web interface. Enter the above <span class="bold">CREATE</span> clauses
      in the top command box (thats has the $ prompt) as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-13.png" alt="Command Box" />
    <div class="img-cap">Command Box</div>
  </div>
  <div id="para-div">
    <p>After entering the <span class="bold">CREATE</span> clauses in the command box of the <span class="bold">Neo4J</span>
      web interface, click on the play button located on the right side as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-14.png" alt="Execute Commands" />
    <div class="img-cap">Execute Commands</div>
  </div>
  <div id="para-div">
    <p>This action will create the necessary nodes and relationships in the <span class="bold">Neo4J</span> database and
      the web interface should display a result window as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-15.png" alt="Execute Results" />
    <div class="img-cap">Execute Results</div>
  </div>
  <div id="para-div">
    <p>Clicking on the database icon located on the left side in the <span class="bold">Neo4J</span> web interface should
      display results like the one shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-16.png" alt="Database Info" />
    <div class="img-cap">Database Info</div>
  </div>
  <div id="para-div">
    <p>As can be seen from the illustration above, we have nodes with two types of labels <span class="bold">Group</span>
      and <span class="bold">User</span>, one relationship type <span class="bold">BELONGS_TO</span>, and few property
      keys such as <span class="bold">context</span>, <span class="bold">email</span>, <span class="bold">name</span>,
      <span class="bold">state</span>, <span class="bold">type</span>, and <span class="bold">uid</span> in the
      <span class="bold">Neo4J</span> database.</p>
  </div>
  <div id="para-div">
    <p>To query the graph elements (nodes and relationships) in the <span class="bold">Neo4J</span> database, one must
      use the <span class="hi-yellow">MATCH</span> clause.</p>
    <p>To query all the nodes (irrepective of the labels), use the following <span class="bold">MATCH</span> pattern:</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">MATCH (n) RETURN n;</span></p>
    <p>where, <span class="bold">n</span> is an identifier for the nodes.</p>
  </div>
  <div id="para-div">
    <p>Enter the above <span class="bold">MATCH</span> statement in the command box of the <span class="bold">Neo4J</span>
      web interface, click on the play button located on the right side as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-17.png" alt="MATCH All" />
    <div class="img-cap">MATCH All</div>
  </div>
  <div id="para-div">
    <p>This action will pattern match all the nodes in the <span class="bold">Neo4J</span> database and the web interface
      should display a result window as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-18.png" alt="All Results" />
    <div class="img-cap">All Results</div>
  </div>
  <div id="para-div">
    <p>In the following paragraphs, we will not show the illustrations for entering the <span class="bold">MATCH</span>
      statements in the command box of the <span class="bold">Neo4J</span> web interface. Instead, we will indicate the
      text for the <span class="bold">MATCH</span> statement and just show the illustration for the results.</p>
  </div>
  <div id="para-div">
    <p>To query all the nodes, with the label <span class="bold">Group</span>, use the following <span class="bold">MATCH</span>
      pattern:</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">MATCH (n:Group) RETURN n;</span></p>
  </div>
  <div id="para-div">
    <p>The result of the pattern match of all the nodes with the label <span class="bold">Group</span> in the web interface
      should display a result window as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-19.png" alt="Label Group" />
    <div class="img-cap">Label Group</div>
  </div>
  <div id="para-div">
    <p>To query all the nodes, with the label <span class="bold">User</span> and with the property key
      <span class="bold">state</span> equals <span class="bold">nj</span>, use one of the following
      <span class="bold">MATCH</span> patterns:</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">MATCH (n:User) WHERE n.state = 'nj' RETURN n;</span></p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;OR</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">MATCH (n:User {state: 'nj'}) RETURN n;</span></p>
  </div>
  <div id="para-div">
    <p>The result of the pattern match of all the nodes with the label <span class="bold">User</span> and with the
      property key <span class="bold">state</span> equals <span class="bold">nj</span> in the web interface should
      display a result window as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-20.png" alt="State Key" />
    <div class="img-cap">State Key</div>
  </div>
  <div id="para-div">
    <p>To query all the nodes, with the label <span class="bold">User</span> and with the property key
      <span class="bold">state</span> equals <span class="bold">nj</span> or <span class="bold">ny</span>,
      use the following <span class="bold">MATCH</span> pattern:</p>
    <p>&nbsp;&nbsp;&nbsp;&nbsp;<span class="hi-yellow">MATCH (n:User) WHERE n.state IN ['nj', 'ny'] RETURN n;</span></p>
  </div>
  <div id="para-div">
    <p>The result of the pattern match of all the nodes with the label <span class="bold">User</span> and with the
      property key <span class="bold">state</span> equals <span class="bold">nj</span> or <span class="bold">ny</span>
      in the web interface should display a result window as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-21.png" alt="State NJ/NY" />
    <div class="img-cap">State NJ/NY</div>
  </div>
  <div id="para-div">
    <p>One may be wondering if there is any command-line interface (like in the relational databases) for working
      with <span class="bold">Neo4J</span> database. Indeed, there is one called <span class="hi-yellow">cypher-shell</span>
      and in the following paragraphs, we will switch to the command-line interface, instead of the web interface.</p>
    <p>Open a terminal window and execute the following <span class="bold">docker</span> command to launch the
      <span class="bold">cypher-shell</span>:</p>
  </div>
  <div id="cmd-div">
    <p>docker exec -ti neo4j bin/cypher-shell -u neo4j</p>
  </div>
  <div id="para-div">
    <p>One will be prompted for a password and on success, the terminal should look as shown in the illustration below:</p>
  </div>
  <div id="img-outer-div"> <img class="img-cls" src="./images/neo4j-22.png" alt="Cypher Shell" />
    <div class="img-cap">Cypher Shell</div>
  </div>
  <div id="para-div">
    <p>To query the property values of the keys <span class="bold">name</span> and <span class="bold">email</span> for all the nodes
      with the label <span class="bold">User</span>, that is related to another node with the label <span class="bold">Group</span>
      that has a property key <span class="bold">name</span> with the value <span class="bold">Project Management</span>,
      execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) -[]-> (g:Group {name: 'Project Management'}) RETURN u.name, u.email;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.1</h4>
    <pre>+---------------------------------------------+
| u.name          | u.email                   |
+---------------------------------------------+
| "Gary White"    | "gary.white@earth.com"    |
| "Charlie Brown" | "charlie.brown@earth.com" |
| "Bob Green"     | "bob.green@earth.com"     |
| "Alice Pink"    | "alice.pink@earth.com"    |
+---------------------------------------------+

4 rows available after 27 ms, consumed after another 1 ms</pre>
  </div>
  <div id="para-div">
    <p>To query the property values of the keys <span class="bold">name</span> and <span class="bold">type</span>
      for all the nodes with the label <span class="bold">User</span>, that is related to another node through the
      relationship type <span class="bold">BELONGS_TO</span> with the property key <span class="bold">context</span>
      with value <span class="bold">architect</span>, execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) -[:BELONGS_TO {context: 'architect'}]-> () RETURN u.name, u.type;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.2</h4>
    <pre>+-----------------------------+
| u.name       | u.type       |
+-----------------------------+
| "Bob Green"  | "employee"   |
| "Harry Blue" | "consultant" |
+-----------------------------+

2 rows available after 18 ms, consumed after another 1 ms</pre>
  </div>
  <div id="para-div">
    <p>To query the property values of the keys <span class="bold">name</span> and <span class="bold">uid</span>
      for all the nodes with the label <span class="bold">User</span> and limit the output to just 5 rows, execute
      the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) RETURN u.name, u.uid LIMIT 5;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.3</h4>
    <pre>+-----------------------------+
| u.name          | u.uid     |
+-----------------------------+
| "Alice Pink"    | "alice"   |
| "Bob Green"     | "bob"     |
| "Charlie Brown" | "charlie" |
| "David Black"   | "david"   |
| "Frank Grey"    | "frank"   |
+-----------------------------+

5 rows available after 12 ms, consumed after another 0 ms</pre>
  </div>
  <div id="para-div">
    <p>To query and return unique values of the property key <span class="bold">type</span> for all the nodes with
      the label <span class="bold">User</span>, that is related to another node through the relationship type
      <span class="bold">BELONGS_TO</span>, execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) -[:BELONGS_TO]-> () RETURN DISTINCT u.type;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.4</h4>
    <pre>+--------------+
| u.type       |
+--------------+
| "employee"   |
| "consultant" |
+--------------+

2 rows available after 21 ms, consumed after another 2 ms</pre>
  </div>
  <div id="para-div">
    <p>To query and return values of the property key <span class="bold">name</span> for all the nodes with
      the label <span class="bold">User</span>, that is related to another node with label
      <span class="bold">Group</span> and the property key <span class="bold">name</span> having the values
      <span class="bold">Core Engineering</span> and <span class="bold">Project Management</span>, through the
      relationship type <span class="bold">BELONGS_TO</span>, execute the following <span class="bold">MATCH</span>
      query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) -[:BELONGS_TO]-> (:Group {name: 'Core Engineering'}), (u) -[:BELONGS_TO]-> (:Group {name: 'Project Management'})
      RETURN u.name;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.5</h4>
    <pre>+-------------+
| u.name      |
+-------------+
| "Bob Green" |
+-------------+

1 row available after 80 ms, consumed after another 2 ms</pre>
  </div>
  <div id="para-div">
    <p>To query and return values of the property key <span class="bold">name</span> for all the nodes with
      the label <span class="bold">User</span> in an ascending order, execute the following <span class="bold">MATCH</span>
      query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) RETURN u.name ORDER BY u.name;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.6</h4>
    <pre>+-----------------+
| u.name          |
+-----------------+
| "Alice Pink"    |
| "Bob Green"     |
| "Charlie Brown" |
| "David Black"   |
| "Frank Grey"    |
| "Gary White"    |
| "Harry Blue"    |
+-----------------+

7 rows available after 36 ms, consumed after another 0 ms</pre>
  </div>
  <div id="para-div">
    <p>To query and return values of the property key <span class="bold">name</span> for all the nodes with
      the label <span class="bold">User</span> in a descending order, execute the following <span class="bold">MATCH</span>
      query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (u:User) RETURN u.name ORDER BY u.name DESC;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.7</h4>
    <pre>+-----------------+
| u.name          |
+-----------------+
| "Harry Blue"    |
| "Gary White"    |
| "Frank Grey"    |
| "David Black"   |
| "Charlie Brown" |
| "Bob Green"     |
| "Alice Pink"    |
+-----------------+

7 rows available after 19 ms, consumed after another 0 ms</pre>
  </div>
  <div id="para-div">
    <p>To set a new property key <span class="bold">gid</span> with the value <span class="bold">cengg</span> for the
      node with the label <span class="bold">Group</span> that has the property key <span class="bold">name</span> with 
      value <span class="bold">Core Engineering</span>, execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (g:Group {name: 'Core Engineering'}) SET g.gid = 'cengg';</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.8</h4>
    <pre>0 rows available after 48 ms, consumed after another 0 ms
Set 1 properties</pre>
  </div>
  <div id="para-div">
    <p>Similarly, set a new property key <span class="bold">gid</span> with the value <span class="bold">pmgmt</span> for
      the node with the label <span class="bold">Group</span> that has the property key <span class="bold">name</span> with 
      value <span class="bold">Project Management</span>, execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (g:Group {name: 'Project Management'}) SET g.gid = 'pmgmt';</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.9</h4>
    <pre>0 rows available after 11 ms, consumed after another 0 ms
Set 1 properties</pre>
  </div>
  <div id="para-div">
    <p>To query and return values for the property key <span class="bold">gid</span> for all the nodes with
      the label <span class="bold">Group</span>, execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (g:Group) RETURN g.gid;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.10</h4>
    <pre>+---------+
| g.gid   |
+---------+
| "pmgmt" |
| "cengg" |
+---------+

2 rows available after 19 ms, consumed after another 0 ms</pre>
  </div>
  <div id="para-div">
    <p>To remove the property key <span class="bold">gid</span> from all the node with the label <span class="bold">Group</span>,
      execute the following <span class="bold">MATCH</span> query:</p>
  </div>
  <div id="cmd-div">
    <p>MATCH (g:Group) REMOVE g.gid;</p>
  </div>
  <div id="para-div">
    <p>On executing the above query, the results should look like the one shown below:</p>
  </div>
  <div id="out-div">
    <h4>Output.11</h4>
    <pre>0 rows available after 12 ms, consumed after another 0 ms
Set 2 properties</pre>
  </div>
  <div id="para-div">
    <p>To exit the <span class="bold">cypher-shell</span>, execute the following command:</p>
  </div>
  <div id="cmd-div">
    <p>:exit</p>
  </div>
  <div id="step-div">
    <p>References</p>
  </div>
  <div id="para-div">
    <p><a href="http://polarsparc.github.io/Neo4J/Neo4J-1.html" target="_blank">
      <span class="bold">Getting Started with Neo4J - Part 1</span></a></p>
    <p><a href="https://neo4j.com/" target="_blank"><span class="bold">Neo4J Official Site</span></a></p>
  </div>
</body>
</html>
